import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        System.out.println("Задача №1");
        /*
        Объявите три массива:
        Целочисленный массив, заполненный тремя цифрами — 1, 2 и 3 —
        с помощью ключевого слова new.
         */
        int [] massiv1 = new int [3];
        massiv1 [0] = 1;
        massiv1 [1] = 2;
        massiv1 [2] = 3;
        /*
        Массив, в котором можно хранить три дробных
        числа — 1.57, 7.654, 9.986. Массив сразу заполните значениями.
         */
        float [] massiv2 = new float[3];
        massiv2 [0] = 1.57F;
        massiv2 [1] = 7.654F;
        massiv2 [2] = 9.986F;
        /*
        Произвольный массив. Тип и количество данных определите сами.
        Самостоятельно выберите способ создания массива:
        с помощью ключевого слова или сразу заполненный элементами.
         */
        char [] massiv3 = {'1', 'e', 'T'};

        System.out.println("Задача №2");
        /*
        Распечатайте на отдельной строчке элементы каждого массива по порядку через запятую.
        В конце строки запятую ставить не надо.
         */
        System.out.println(massiv1 [0] + ", " + massiv1 [1] + ", " + massiv1 [2]);
        System.out.println(massiv2 [0] + ", " + massiv2 [1] + ", " + massiv2 [2]);
        System.out.println(massiv3 [0] + ", " + massiv3 [1] + ", " + massiv3 [2]);

        System.out.println("Задача №3");
        /*
        Распечатайте на отдельной строчке элементы каждого массива в обратном порядке
        через запятую. В конце строки запятую ставить не надо.
        Если в задаче 2 в консоль у вас вывелся результат:
        1, 2, 3
        1.57, 7.654, 9.986
        // Произвольные элементы третьего массива
        то в этой задаче результат должен быть таким:
        3, 2, 1
        9.986, 7.654, 1.57
        // Произвольные элементы третьего массива в обратном порядке
         */
        System.out.println(massiv1 [2] + ", " + massiv1 [1] + ", " + massiv1 [0]);
        System.out.println(massiv2 [2] + ", " + massiv2 [1] + ", " + massiv2 [0]);
        System.out.println(massiv3 [2] + ", " + massiv3 [1] + ", " + massiv3 [0]);

        System.out.println("Задача №4");
        /*
        Пройдитесь по первому целочисленному массиву и все нечетные
        числа в нем сделайте четными (нужно прибавить 1).
        Важно: код должен работать с любым целочисленным массивом,
        поэтому для решения задания используйте циклы.
        Распечатайте результат преобразования в консоль.
         */
        for (int i = 0; i < massiv1.length; i++) {
            if (massiv1[i] % 2 != 0) {
                massiv1[i] ++;
            }
        }
        System.out.println(Arrays.toString(massiv1));
    }
}